{
  "WorkshopId": 3013535764,
  "Title": "Improved Combat Tooltips",
  "Description": "Ever dreamed you'd see the full devastation of your 6 armed [url=https://steamcommunity.com/sharedfiles/filedetails/?id=2858367327]Insectoid[/url] Phase Cannonier omniphasing into your zero jell directly on the tooltip? Today is the day it comes true.\r\n\r\n[b]Improved Combat Tooltips[/b] brings you informative and snappy additions for even more combat fun, such as:\r\n\r\n[h1]Combined Multiple damages [/h1]\r\n[img]https://i.imgur.com/IrAmD7W.gif[/img]\r\n\r\nIf one action does multiple instances of damage to a target, combine them into one tooltip, bigger in proportion to damage dealt to max HP. (That was a lot of hits huh).\r\nAs you can see in the gif above, even this snap(pped)jaw's instances of bleeding are combined into one tooltip (the small tooltips following the -15 one are me spamming the wait button to show bleeding damage. Only one appeared per turn). You can finally see how useful some abilities really are! \r\n\r\n[h1]Colored Special Damage [/h1]\r\n[img]https://i.imgur.com/1fneQpr.gif[/img]\r\n\r\nElemental and some special damage will show colored tooltips. Combined tooltips are included: if you did Physical + Cold + Electric damage this action, the combined tooltip will have the color of the most significant damage dealt, or always have the color of the highest non Physical damage if applicable (toggleable option).\r\n\r\n[h1]Visible Penetrations (toggleable)[/h1]\r\n[img]https://i.imgur.com/8MaEMtb.gif[/img]\r\nA smaller tooltip will appear above you when you deal damage, showing the highest penetrations applied this action. Follows the colors of message log penetrations and toggleable to also display the penetrations of other characters above them.\r\n\r\n[h1]Visible Miss and Block Rolls (toggleable)[/h1]\r\n[img]https://i.imgur.com/YJVwb9D.gif[/img]\r\nDisplays full rolls against DV or AV on misses and blocks [att vs def]. So you know how close you were to hit or pen. The brighter the color of the tooltip is, the bigger the fail was, in the same way higher penetrations display brighter colors. More clues to escape now!\r\n\r\n[h1]Visible Penetration Rolls (toggleable)[/h1]\r\n[img]https://i.imgur.com/HFHpw4D.gif[/img]\r\nSee penetration rolls when your hits are successful, either along or without the actual number of penetrations. \r\nKeep in mind that in vanilla Qud, the [number] displayed in the message log on such hits is not your penetration roll against enemy armor, but your actual DV (to-hit) roll. I deemed it unnecessary to display in case of successful hits so I kept it out of this tooltip. Let me know if you'd like to see it anyway.\r\n\r\n[h1]Show XP Points gained (toggleable)[/h1]\r\n[img]https://i.imgur.com/SE3TXjZ.gif[/img]\r\nXP Points gained will be displayed on the middle of your character - and of course, also combined when accidentally letting an Hand-E-Nuke slip in phase. Enjoy more direct gratification for your actions!\r\n\r\n[h2]All at the same time :)[/h2]\r\n[img]https://i.imgur.com/kBlMdQ1.gif[/img]\r\n(Mod now fully supports ranged damage penetrations!)\r\n\r\n[h1]And also…[/h1]\r\n[h2]* Smaller tooltips for continuous damage[/h2]\r\nContinuous damage like bleeding or poison will be shown in smaller tooltips to emphasize their indirect nature.\r\n[h2]* Show -0 when damage is applied but is 0 (toggleable)[/h2]\r\nSometimes you want to know something did something for nothing. Provided an option to show a -0 tooltip when elemental damage has been resisted, bleeding ineffective, or when thrown rocks infamously hit for 0…\r\n\r\nMod is compatible with existing games and free to enable/disable mid save. Only tested on newest beta but it should work on stable too. Let me know if anything up and have fun ;)",
  "Tags": "UX,Cosmetic,Combat",
  "Visibility": "2",
  "ImagePath": "preview.png"
}